#ifndef __DQG3DBASIC__
#define __DQG3DBASIC__
#include <iostream>
#include <dqg/Data.h>
#include <dqg/DQGParam.h>
#include<set>
#include<map>
#include <unordered_map>
#include <unordered_set>

struct Pagoda {
  PointLBd A, B, C,D;
};
struct AirClear {
  PointLBd A, B, C, D;
  };
struct BuildingArea {
  PointLBd A, B, C, D;
} ;


/*---------------------------------------------------*/
/*-------------------------查找表--------------------*/
/*---------------------------------------------------*/
static const uint64_t MortonTable256[256] ={  
    0x0000, 0x0001, 0x0004, 0x0005, 0x0010, 0x0011, 0x0014, 0x0015,   
    0x0040, 0x0041, 0x0044, 0x0045, 0x0050, 0x0051, 0x0054, 0x0055,   
    0x0100, 0x0101, 0x0104, 0x0105, 0x0110, 0x0111, 0x0114, 0x0115,   
    0x0140, 0x0141, 0x0144, 0x0145, 0x0150, 0x0151, 0x0154, 0x0155,   
    0x0400, 0x0401, 0x0404, 0x0405, 0x0410, 0x0411, 0x0414, 0x0415,   
    0x0440, 0x0441, 0x0444, 0x0445, 0x0450, 0x0451, 0x0454, 0x0455,   
    0x0500, 0x0501, 0x0504, 0x0505, 0x0510, 0x0511, 0x0514, 0x0515,   
    0x0540, 0x0541, 0x0544, 0x0545, 0x0550, 0x0551, 0x0554, 0x0555,   
    0x1000, 0x1001, 0x1004, 0x1005, 0x1010, 0x1011, 0x1014, 0x1015,   
    0x1040, 0x1041, 0x1044, 0x1045, 0x1050, 0x1051, 0x1054, 0x1055,   
    0x1100, 0x1101, 0x1104, 0x1105, 0x1110, 0x1111, 0x1114, 0x1115,   
    0x1140, 0x1141, 0x1144, 0x1145, 0x1150, 0x1151, 0x1154, 0x1155,   
    0x1400, 0x1401, 0x1404, 0x1405, 0x1410, 0x1411, 0x1414, 0x1415,   
    0x1440, 0x1441, 0x1444, 0x1445, 0x1450, 0x1451, 0x1454, 0x1455,   
    0x1500, 0x1501, 0x1504, 0x1505, 0x1510, 0x1511, 0x1514, 0x1515,   
    0x1540, 0x1541, 0x1544, 0x1545, 0x1550, 0x1551, 0x1554, 0x1555,   
    0x4000, 0x4001, 0x4004, 0x4005, 0x4010, 0x4011, 0x4014, 0x4015,   
    0x4040, 0x4041, 0x4044, 0x4045, 0x4050, 0x4051, 0x4054, 0x4055,   
    0x4100, 0x4101, 0x4104, 0x4105, 0x4110, 0x4111, 0x4114, 0x4115,   
    0x4140, 0x4141, 0x4144, 0x4145, 0x4150, 0x4151, 0x4154, 0x4155,   
    0x4400, 0x4401, 0x4404, 0x4405, 0x4410, 0x4411, 0x4414, 0x4415,   
    0x4440, 0x4441, 0x4444, 0x4445, 0x4450, 0x4451, 0x4454, 0x4455,   
    0x4500, 0x4501, 0x4504, 0x4505, 0x4510, 0x4511, 0x4514, 0x4515,   
    0x4540, 0x4541, 0x4544, 0x4545, 0x4550, 0x4551, 0x4554, 0x4555,   
    0x5000, 0x5001, 0x5004, 0x5005, 0x5010, 0x5011, 0x5014, 0x5015,   
    0x5040, 0x5041, 0x5044, 0x5045, 0x5050, 0x5051, 0x5054, 0x5055,   
    0x5100, 0x5101, 0x5104, 0x5105, 0x5110, 0x5111, 0x5114, 0x5115,   
    0x5140, 0x5141, 0x5144, 0x5145, 0x5150, 0x5151, 0x5154, 0x5155,   
    0x5400, 0x5401, 0x5404, 0x5405, 0x5410, 0x5411, 0x5414, 0x5415,   
    0x5440, 0x5441, 0x5444, 0x5445, 0x5450, 0x5451, 0x5454, 0x5455,   
    0x5500, 0x5501, 0x5504, 0x5505, 0x5510, 0x5511, 0x5514, 0x5515,   
    0x5540, 0x5541, 0x5544, 0x5545, 0x5550, 0x5551, 0x5554, 0x5555  
  };

 static const uint64_t  morton256_z [256]= {
  0x00000000, 0x00000004, 0x00000020, 0x00000024,
  0x00000100, 0x00000104, 0x00000120, 0x00000124,
  0x00000800, 0x00000804, 0x00000820, 0x00000824,
  0x00000900, 0x00000904, 0x00000920, 0x00000924,
  0x00004000, 0x00004004, 0x00004020, 0x00004024,
  0x00004100, 0x00004104, 0x00004120, 0x00004124,
  0x00004800, 0x00004804, 0x00004820, 0x00004824,
  0x00004900, 0x00004904, 0x00004920, 0x00004924,
  0x00020000, 0x00020004, 0x00020020, 0x00020024,
  0x00020100, 0x00020104, 0x00020120, 0x00020124,
  0x00020800, 0x00020804, 0x00020820, 0x00020824,
  0x00020900, 0x00020904, 0x00020920, 0x00020924,
  0x00024000, 0x00024004, 0x00024020, 0x00024024,
  0x00024100, 0x00024104, 0x00024120, 0x00024124,
  0x00024800, 0x00024804, 0x00024820, 0x00024824,
  0x00024900, 0x00024904, 0x00024920, 0x00024924,
  0x00100000, 0x00100004, 0x00100020, 0x00100024,
  0x00100100, 0x00100104, 0x00100120, 0x00100124,
  0x00100800, 0x00100804, 0x00100820, 0x00100824,
  0x00100900, 0x00100904, 0x00100920, 0x00100924,
  0x00104000, 0x00104004, 0x00104020, 0x00104024,
  0x00104100, 0x00104104, 0x00104120, 0x00104124,
  0x00104800, 0x00104804, 0x00104820, 0x00104824,
  0x00104900, 0x00104904, 0x00104920, 0x00104924,
  0x00120000, 0x00120004, 0x00120020, 0x00120024,
  0x00120100, 0x00120104, 0x00120120, 0x00120124,
  0x00120800, 0x00120804, 0x00120820, 0x00120824,
  0x00120900, 0x00120904, 0x00120920, 0x00120924,
  0x00124000, 0x00124004, 0x00124020, 0x00124024,
  0x00124100, 0x00124104, 0x00124120, 0x00124124,
  0x00124800, 0x00124804, 0x00124820, 0x00124824,
  0x00124900, 0x00124904, 0x00124920, 0x00124924,
  0x00800000, 0x00800004, 0x00800020, 0x00800024,
  0x00800100, 0x00800104, 0x00800120, 0x00800124,
  0x00800800, 0x00800804, 0x00800820, 0x00800824,
  0x00800900, 0x00800904, 0x00800920, 0x00800924,
  0x00804000, 0x00804004, 0x00804020, 0x00804024,
  0x00804100, 0x00804104, 0x00804120, 0x00804124,
  0x00804800, 0x00804804, 0x00804820, 0x00804824,
  0x00804900, 0x00804904, 0x00804920, 0x00804924,
  0x00820000, 0x00820004, 0x00820020, 0x00820024,
  0x00820100, 0x00820104, 0x00820120, 0x00820124,
  0x00820800, 0x00820804, 0x00820820, 0x00820824,
  0x00820900, 0x00820904, 0x00820920, 0x00820924,
  0x00824000, 0x00824004, 0x00824020, 0x00824024,
  0x00824100, 0x00824104, 0x00824120, 0x00824124,
  0x00824800, 0x00824804, 0x00824820, 0x00824824,
  0x00824900, 0x00824904, 0x00824920, 0x00824924,
  0x00900000, 0x00900004, 0x00900020, 0x00900024,
  0x00900100, 0x00900104, 0x00900120, 0x00900124,
  0x00900800, 0x00900804, 0x00900820, 0x00900824,
  0x00900900, 0x00900904, 0x00900920, 0x00900924,
  0x00904000, 0x00904004, 0x00904020, 0x00904024,
  0x00904100, 0x00904104, 0x00904120, 0x00904124,
  0x00904800, 0x00904804, 0x00904820, 0x00904824,
  0x00904900, 0x00904904, 0x00904920, 0x00904924,
  0x00920000, 0x00920004, 0x00920020, 0x00920024,
  0x00920100, 0x00920104, 0x00920120, 0x00920124,
  0x00920800, 0x00920804, 0x00920820, 0x00920824,
  0x00920900, 0x00920904, 0x00920920, 0x00920924,
  0x00924000, 0x00924004, 0x00924020, 0x00924024,
  0x00924100, 0x00924104, 0x00924120, 0x00924124,
  0x00924800, 0x00924804, 0x00924820, 0x00924824,
  0x00924900, 0x00924904, 0x00924920, 0x00924924 };

// LUT for Morton2D decode X
static const unsigned char Morton2D_decode_x_256[256] = {
  0,1,0,1,2,3,2,3,0,1,0,1,2,3,2,3,
  4,5,4,5,6,7,6,7,4,5,4,5,6,7,6,7,
  0,1,0,1,2,3,2,3,0,1,0,1,2,3,2,3,
  4,5,4,5,6,7,6,7,4,5,4,5,6,7,6,7,
  8,9,8,9,10,11,10,11,8,9,8,9,10,11,10,11,
  12,13,12,13,14,15,14,15,12,13,12,13,14,15,14,15,
  8,9,8,9,10,11,10,11,8,9,8,9,10,11,10,11,
  12,13,12,13,14,15,14,15,12,13,12,13,14,15,14,15,
  0,1,0,1,2,3,2,3,0,1,0,1,2,3,2,3,
  4,5,4,5,6,7,6,7,4,5,4,5,6,7,6,7,
  0,1,0,1,2,3,2,3,0,1,0,1,2,3,2,3,
  4,5,4,5,6,7,6,7,4,5,4,5,6,7,6,7,
  8,9,8,9,10,11,10,11,8,9,8,9,10,11,10,11,
  12,13,12,13,14,15,14,15,12,13,12,13,14,15,14,15,
  8,9,8,9,10,11,10,11,8,9,8,9,10,11,10,11,
  12,13,12,13,14,15,14,15,12,13,12,13,14,15,14,15
  };
  
  // LUT for Morton2D decode Y
  static const unsigned char Morton2D_decode_y_256[256] = {
  0,0,1,1,0,0,1,1,2,2,3,3,2,2,3,3,
  0,0,1,1,0,0,1,1,2,2,3,3,2,2,3,3,
  4,4,5,5,4,4,5,5,6,6,7,7,6,6,7,7,
  4,4,5,5,4,4,5,5,6,6,7,7,6,6,7,7,
  0,0,1,1,0,0,1,1,2,2,3,3,2,2,3,3,
  0,0,1,1,0,0,1,1,2,2,3,3,2,2,3,3,
  4,4,5,5,4,4,5,5,6,6,7,7,6,6,7,7,
  4,4,5,5,4,4,5,5,6,6,7,7,6,6,7,7,
  8,8,9,9,8,8,9,9,10,10,11,11,10,10,11,11,
  8,8,9,9,8,8,9,9,10,10,11,11,10,10,11,11,
  12,12,13,13,12,12,13,13,14,14,15,15,14,14,15,15,
  12,12,13,13,12,12,13,13,14,14,15,15,14,14,15,15,
  8,8,9,9,8,8,9,9,10,10,11,11,10,10,11,11,
  8,8,9,9,8,8,9,9,10,10,11,11,10,10,11,11,
  12,12,13,13,12,12,13,13,14,14,15,15,14,14,15,15,
  12,12,13,13,12,12,13,13,14,14,15,15,14,14,15,15
  };
  /*---------------------------------------------------*/
  /*-----------------对数计算--------------------------*/
  /*---------------------------------------------------*/
inline unsigned int log2_d(unsigned int n) {
  unsigned int result = 0;  unsigned int cp = n;
  if (n & 0xffff0000) { result += 16; n >>= 16; }
  if (n & 0x0000ff00) { result += 8; n >>= 8; }
  if (n & 0x000000f0) { result += 4; n >>= 4; }
  if (n & 0x0000000c) { result += 2; n >>= 2; }
  if (n & 0x00000002) { result += 1; n >>= 1; }
  if (cp > 1 << result)  result++;
  return result;
}

inline int log2_ull(uint64_t n) {
  unsigned int result = 0;  uint64_t cp = n;
  if (n & 0xffffffff00000000) { result += 32;n >>=   32;}
  if (n & 0x00000000ffff0000) { result += 16;n >>= 16; }
  if (n & 0x000000000000ff00) { result += 8; n >>= 8; }
  if (n & 0x00000000000000f0) { result += 4; n >>= 4; }
  if (n & 0x000000000000000c) { result += 2; n >>= 2; }
  if (n & 0x0000000000000002) { result += 1; n >>= 1; }
  //if (cp > 1 << result)  result++;
  return result;
}



/**
 * IJ数组去重
 * @param arr 需要去重的二维数组
 * @returns 去重后的二维数组
 */
inline vector<IJ> getUnique(const vector<IJ>& points) {
  unordered_set<std::string> uniqueSet;
  vector<IJ> uniquePoints;

  for (const auto& point : points) {
      string key = std::to_string(point.row) + "," + to_string(point.column);
      if (uniqueSet.find(key) == uniqueSet.end()) {
          uniqueSet.insert(key);
          uniquePoints.push_back(point);
      }
  }
  return uniquePoints;
}

/**
* IJH数组去重
* @param arr 需要去重的二维数组
* @returns 去重后的二维数组
*/
inline vector<IJH> getUnique(const vector<IJH>& points) {
  unordered_set<string> uniqueSet;
  vector<IJH> uniquePoints;

  for (const auto& point : points) {
      string key = to_string(point.row) + "," + to_string(point.column) + "," + to_string(point.layer);
      if (uniqueSet.find(key) == uniqueSet.end()) {
          uniqueSet.insert(key);
          uniquePoints.push_back(point);
      }
  }
  return uniquePoints;
}


/**
* 检查两个IJH对象的值是否相等
*/
inline bool isObjectValueEqual(const IJH& a, const IJH& b) {
  return a.row == b.row && a.column == b.column && a.layer == b.layer;
}
/**
* 给定三角形面片的三个顶点，求出平面方程
*平面方程通常表示为：??+??+????=0
*const IJH& p1：第一个点的坐标，类型为 IJH 结构体，包含 row、column 和 layer。
*const IJH& p2：第二个点的坐标，类型为 IJH 结构体。
*const IJH& p3：第三个点的坐标，类型为 IJH 结构体。
*double& a：输出参数，表示平面方程的法向量在x方向的分量。
*double& b：输出参数，表示平面方程的法向量在y方向的分量。
*double& c：输出参数，表示平面方程的法向量在z方向的分量。
*double& d：输出参数，表示平面方程的常数项。
**/
inline void calculatePlaneEquation(const IJH& point1, const IJH& point2, const IJH& point3,
    double& a, double& b, double& c, double& d) {


    // 将点的整数坐标转换为浮点数
    double x1 = static_cast<double>(point1.row);
    double y1 = static_cast<double>(point1.column);
    double z1 = static_cast<double>(point1.layer);

    double x2 = static_cast<double>(point2.row);
    double y2 = static_cast<double>(point2.column);
    double z2 = static_cast<double>(point2.layer);

    double x3 = static_cast<double>(point3.row);
    double y3 = static_cast<double>(point3.column);
    double z3 = static_cast<double>(point3.layer);

    // 计算两个方向向量
    double v1x = x2 - x1, v1y = y2 - y1, v1z = z2 - z1;
    double v2x = x3 - x1, v2y = y3 - y1, v2z = z3 - z1;

    // 计算法向量（叉乘）
    a = v1y * v2z - v1z * v2y;
    b = v1z * v2x - v1x * v2z;
    c = v1x * v2y - v1y * v2x;

    // 计算 d
    d = -(a * x1 + b * y1 + c * z1);
   // cout << "Plane Equation: a=" << a << ", b=" << b << ", c=" << c << ", d=" << d << endl;
}

/*---------------------------------------------------*/
/*-----------------DQG编码中间步骤---------------------*/
/*---------------------------------------------------*/
//求八分体号
uint8_t LB2Oct(double Lng, double Lat);

//局部和全局经纬度转换
PointLBd LBinOctant(double Lng, double Lat, uint8_t octNum);
void LBinGlobal(double& l,double& b, uint8_t oct);

///2D和3D经纬度转IJ和八分体号
IJ_oct_int LB2DQG_ij_oct_int(double l, double b, uint8_t level);
IJH_oct_int LBH2DQG_ijh_oct_int(double l, double b, double hei, uint8_t level);

//2D和3DIJ和八分体号转DQG字符串
string IJ_oct_int2str(IJ_oct_int IJ);
string IJH_oct_int2str(IJH_oct_int IJ);

//编码_经纬度转IJ

IJ LB2IJ(double l,double b, uint8_t level);
IJH LBH2IJH(double l,double b,double hei, uint8_t level);

//2D和3D莫顿编码

uint64_t mortonEncode_2D_LUT(uint32_t x, uint32_t y);
uint64_t mortonEncode_3D_LUT(uint32_t y, uint32_t x, uint32_t z);

std::string toOctalString(uint64_t number);
/*---------------------------------------------------*/
/*-----------------DQG解码中间步骤--------------------*/
/*---------------------------------------------------*/
IJ Morto2IJ(uint64_t GridMorton);
IJH Morto2IJH(uint64_t morton);

#endif
